HELYXcore-4.4.0/examples/tests/incompressible/simpleSyntheticInflow/0/U
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1.0 0.0 0.0);

boundaryField
{
    bottom
    {
        type            symmetry;
    }
    top
    {
        type            symmetry;
    }
    inlet
    {
        type            synInflow;
        origin          (0 0 0);
        zDir            (0 0 1);
        sf_dictName     inflowGenerationDict;
        vc_dictName     inflowCorrectionDict;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    dx
    {
        type            symmetry;
    }
    dy
    {
        type            symmetry;
    }
}


// ************************************************************************* //
