HELYXcore-4.4.0/examples/tests/incompressible/simpleSyntheticInflow/0/k
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottom
    {
        type            symmetry;
    }
    top
    {
        type            symmetry;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 1e-12;
    }
    outlet
    {
        type            zeroGradient;
    }
    dx
    {
        type            symmetry;
    }
    dy
    {
        type            symmetry;
    }
}


// ************************************************************************* //
