HELYXcore-4.4.0/examples/tests/incompressible/simpleSyntheticInflow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.00;

vertices
(
    (0.0 -1.0 -1.0)
    (2.0 -1.0 -1.0)
    (2.0 1.0 -1.0)
    (0.0 1.0 -1.0)
    (0.0 -1.0 1.0)
    (2.0 -1.0 1.0)
    (2.0 1.0 1.0)
    (0.0 1.0 1.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 50) simpleGrading (1 1 1)
);

edges ();

boundary
(
    bottom
    {
        type symmetry;
        faces
        (
            (0 1 2 3)
        );
    }
    top
    {
        type symmetry;
        faces
        (
            (4 5 6 7)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    dx
    {
        type symmetry;
        faces
        (
            (0 1 5 4)
        );
    }
    dy
    {
        type symmetry;
        faces
        (
            (3 2 6 7)
        );
    }
);


// ************************************************************************* //
